/*
렛잇고 파에조 부저 연주
혹시 오징어 게임
*/
#define Buzzer 6
int term = 2000;
//4옥타브
const float c4 = 261.6256, d4 = 293.6648, e4 = 329.6276, f4 = 349.2282, g4 = 391.9954, a4 = 440.0, b4 = 493.8833;

//5옥타브
const float c5 = 523.2511, d5 = 587.3295, e5 = 659.2551, f5 = 698.4565, g5 = 783.9909, a5 = 880.0, b5 = 987.7666;
const float cF5 = 987.7666,dF5 = 553.3653, fF5= 659.2551,gF5 = 739.9888, aF5 = 830.6094, bF5 = 932.3275;

//6옥타브
const float c6 = 1146.502, d6 = 1174.659, e6 = 1318.510, f6 = 1396.913, g6 = 1567.982, a6 = 1760.0, b6 =1864.655;
const float cF6= 1864.655, dF6=1108.731,fF6 = 1318.510, gF6 = 1479.978, aF6 = 1661.219, bF6 =1864.655;

//7옥타브
const float c7= 2093.055, dF7 = 2217.461, d7 = 2349.318,eF7 = 2489.016,e7 = 2637.020,f7 = 2793.826,gF7 = 2959.955,g7= 3135.963,aF7=3322.438,a7 =3520.000,bF7= 3729.310,b7= 3951.066;

//악보
const PROGMEM float NoteSong[][2] = { //음(화음 중 가장 높음 음), 박자(16분 이면 16, 8분이면 8), 가로 길이 2인 2차원 배열

{b5, 8},{c6, 8},{e5, 8},{b5, 8},{b5, 8},{c6, 8/3},
{b5, 8},{c6, 8},{e5, 8},{c6, 8},{c6, 8},{b5, 4},{d5, 8},
{a5, 8},{b5, 8},{d5,8},{a5, 8},{a5, 8},{b5, 4},{d5, 8}, //1-1
{g5, 2},{f5, 2},
{b5, 8},{c6, 8},{e5, 8},{b5, 8},{b5, 8},{c6, 4},
{c6, 8},{b5, 8},{e5, 8},{c6, 8},{c6, 8},{b5, 4},{d5, 8},
{a5, 8},{b5, 8},{d5, 8},{a5, 8},{a5, 4},{b5, 8},{d5, 8}, //1-2
{g5, 2},{f5, 4},{0, 8},{d5, 8}, //간주 끈 The
{e5, 4},{e5, 4},{e5, 4},{e5, 8},{e5, 8}, //snow glows white on the
{e5, 8},{d5, 8},{c5, 8},{c5, 8},{c5, 4},{c5, 8},{c5, 8}, //1-3
{d5, 8},{d5, 4},{d5, 8},{c5, 8},{b4, 8},{a4, 8},
{a4, 2},{0, 4},{0, 8},{a4, 8},
{e5, 8},{e5, 8},{e5, 8},{e5, 8},{e5, 4},{g5, 8},{g5, 8}, //1-4

{c5, 2},{0, 8},{a4, 8},{b4, 8},{c5, 8},
{c5, 2},{0, 8},{g4, 8},{e5, 8},{e5, 8},
{d5, 2},{0, 8},{c5, 8},{d5, 8},{e5, 8}, //4-1
{e5, 8},{e5, 4},{f5, 8},{f5, 8},{e5, 8},{d5, 8},{c5, 8},
{d5, 8},{c5, 8/3}, {0, 2},
{g5, 4},{e5, 8},{e5, 8},{e5, 4},{d5, 4}, //4-2
{d5, 4},{0, 4},{c5, 4},{c5, 4},
{g5, 8/3},{e5, 8},{e5, 4},{c5, 4},
{c5, 2},{0, 4},{c5, 8},{c5, 8}, //4-3
{b4, 8/3},{g4, 8},{g4, 4},{g4, 4},
{g4, 4/3},{0,8},{f4, 8},
{f4,4},{f4,8},{f4,8},{e4,8},{f4,8},{e4,8},{f4,8},{f4,8}, //4-4

};
/*배열의 용량이 크기 때문에 동적 메모리에 다 저장을 못해서 PROGMEM을 이용해서 스캐치 저장 공간(플래시메모리)에 저장
반드시 const 사용해야 하고, 메모리에 헥스코드로 저장되기 때문에 pgm_read_float(주소)로 하나 씩 데이터를 읽어와야한다. float 말고도 dword, word 같은 것도 있으니 참고
주소를 가르키는 연산자는 &를 상수 변수 앞에 둔다.
배열 포인터에 이 주소값을 저장에서 포인터를 대신 쓸 수 있다.
*/

void setup()
{
  pinMode(Buzzer, OUTPUT);
  for (int i = 0; i < (sizeof(NoteSong) / 4); i++) //8로 해야될 것 같은데, 그러면 반 밖에 안나옴, (float의 크기는 4임)
  {
    float Melody = pgm_read_float(&NoteSong[i][0]);
    float Tempo = pgm_read_float(&NoteSong[i][1]);
    tone(Buzzer, Melody, term / Tempo);
    delay((term / Tempo)*1.1);
  }
}



void loop()
{
}
